<style>
    <!--
    -->
    <?php //echo file_get_contents(FOLDERIMG . 'map/mapCustom.css') ?>
    .animation {
        width: 100%;
    }

    .container-blog {
        width: 100%;
        height: auto;
        position: relative;
    }

    a {
        cursor: pointer;
    }

    .head-logo-map {
        background: url('<?php get_img('logo.png','map'); ?>') top left no-repeat;
        top: 5px;
        left: 10%;
        z-index: 3;
        width: 100%;
        height: 100%;
        opacity: 1;
        position: absolute;
        animation-name: stretchX;
        animation-duration: 2s;
    }

    .head-map {
        background: url('<?php get_img('Untitled-3.png','map'); ?>') top center no-repeat;
        top: 10px;
        z-index: 5;
        width: 100%;
        height: 100%;
        opacity: 1;
        position: absolute;
    }

    .head-star {
        background: url('<?php get_img('Untitled-2.png','map');?>') no-repeat;
        top: 0;
        left: 70%;
        z-index: 3;
        width: 100%;
        height: 100%;
        opacity: 1;
        position: absolute;
    }

    .bg-map {
        background: url('<?php get_img('bg.jpg','map');?>') top center no-repeat;
        top: 0;
        z-index: 1;
        width: 100%;
        height: 720px;
        opacity: 1;
    }

    .map {
        background: url('<?php get_img('map.png','map');?>') top center no-repeat;
        z-index: 2;
        top: 10px;
        width: 100%;
        height: 100%;
        opacity: 1;
        position: absolute;
    }

    .pu {
        background: url('<?php get_img('pu.png','map');?>') top center no-repeat;
        width: 100%;
        height: 35%;
        left: 500px;
        z-index: 2;
        position: absolute;
        animation-name: head-pu;
        animation-duration: 2s;
    }

    .pin-map {
        position: absolute;
        z-index: 99;
        animation-name: stretch;
        animation-duration: 1.5s;
    }

    .pic {
        position: absolute;
        z-index: 1060;
        top: -26px;
        left: -190px;
        animation-name: stretch;
        animation-duration: 1s;
    }

    @keyframes stretch {
        0% {
            transform: translateY(0px);
        }
        50% {
            transform: translateY(-5px);
        }
        100% {
            transform: translateY(0px);
        }
    }

    @keyframes stretchX {
        0% {
            transform: translateX(0px);
        }
        50% {
            transform: translateX(-5px);
        }
        100% {
            transform: translateX(0px);
        }
    }

    @keyframes head-pu {
        0% {
            opacity: 0;
        }
        50% {
            opacity: 1;
            transform: rotate(7deg);
        }
        100% {
            opacity: 0;
        }
    }

    @keyframes star {
        0% {
            opacity: 0;
        }
        50% {
            opacity: 1;
        }
        100% {
            opacity: 0;
        }
    }
</style>

<div class="container-blog" style="overflow:hidden; z-index:1;">
    <div class="animation" id="animation" data-img="<?php get_img('travel.png', 'map'); ?>">
        <div class="head-logo-map animated infinite" style="animation-delay: 0.2s;"></div>
        <div class="head-map"></div>
        <div class="head-star animated infinite"></div>
        <div class="pu animated infinite"></div>
        <div class="pu animated infinite"></div>
        <div class="bg-map">
            <div class="map"></div>
            <div class="pin-map animated infinite" style="opacity: 1; top:19%;left: 25%;
    animation-delay: 0.4s;">
                <a class="popup" data-img="<?php get_img('doikam.png', 'map'); ?>"
                   data-head="วัดพระธาตุดอยคำ"
                   data-detail="วัดพระธาตุดอยคำ แต่เดิมชื่อ วัดสุวรรณบรรพต เป็นวัดที่มีชื่อเสียงด้านการขอพร บนบาน
                    และเป็นวัดที่สำคัญของจังหวัดเชียงใหม่ อายุเก่าแก่กว่า 1,300 ปี ตั้งอยู่บริเวณดอยคำ
                    ด้านหลังอุทยานหลวงราชพฤกษ์ วัดพระธาตุดอยคำ มีจุดชมวิว ที่สามารถมองเห็นวิวทิวทัศน์รอบเมืองเชียงใหม่
                    สนามบินเชียงใหม่ นอกจากนี้ยามค่ำคืนเมื่อมองขึ้นไปบนพระธาตุดอยคำจะเห็นองค์พระธาตุเหลืองอร่ามสว่างไสว
                    ซึ่งมีความงดงาม

                    วัดพระธาตุดอยคำสร้างในรัชสมัยพระนางจามเทวีกษัตริย์แห่งหริภุญชัย โดยพระโอรสทั้ง 2 เป็นผู้สร้างในปี
                    พ.ศ. 1230 ประกอบด้วยเจดีย์บรรจุพระบรมสารีริกธาตุของพระพุทธเจ้า ศาลาการเปรียญกุฏิสงฆ์
                    และพระพุทธรูปปูนปั้น เดิมชื่อวัดสุวรรณบรรพต แต่ชาวบ้านเรียกว่า “วัดดอยคำ”

                    พ.ศ. 2509 ขณะนั้นวัดพระธาตุดอยคำเป็นวัดร้าง ต่อมากรุแตกชาวบ้านพบโบราณวัตถุหลายชิ้น เช่น พระรอดหลวง
                    พระหินทรายปิดทององค์ใหญ่ พระสามหมอ(เนื้อดิน) ซึ่งนำมาประดิษฐานไว้ ณ วัดพระธาตุดอยคำ
                    พระธาตุดอยคำนอกจากจะเป็นที่สักการบูชาของคนท้องถิ่นแล้ว
                    ยังเป็นสัญลักษณ์อีกแห่งหนึ่งของการบินไทยที่ใช้กำหนดพื้นที่ทางสายตา
                    ก่อนที่จะนำเครื่องบินลงจอดที่สนามบินเชียงใหม่ ด้วยเหตุผลประการนี้การบินไทยก็มีส่วนช่วยในการบูรณะวัด

                    หลวงพ่อทันใจ แห่งวัดพระธาตุดอยคำ ซึ่งสร้างขึ้นในรัชสมัย พญากือนา กษัตริย์แห่งอาณาจักรล้านนา
                    ปัจจุบันมีชื่อเสียงอย่างมากในเรื่องของความศักดิ์สิทธิ์หลายต่อหลายครั้งที่มีผู้เดินทางมาขอพร บนบาน
                    แล้ว ประสบความสำเร็จ และได้เดินทางกลับมาถวายดอกมะลิเพื่อแก้บน

                    การเดินทางขึ้นไปวัดพระธาตุดอยคำ มี 2 ทาง คือ ทางซ้ายจะเป็นทางขึ้นโดยรถยนต์
                    ส่วนทางขวาจะเป็นทางเดินขึ้นโดยบันได"
                >
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>
            <div class="pin-map animated infinite" style="opacity: 1; top: 37%;left: 32%;
    animation-delay: 0.2s;">
                <a class="popup" data-img="<?php get_img('', ''); ?>"
                   data-head="อุทยานหลวงราชพฤกษ์"
                   data-detail="เนื่องในมหามงคลสมัยที่พระบาทสมเด็จพระเจ้าอยู่หัว ทรงครองสิริราชสมบัติครบ 60 ปี ใน พ.ศ.2549 และทรงเจริญพระชนมายุ 80 พรรษา ในวันที่ 5 ธันวาคม 2550
และคณะรัฐมนตรีมีมติ เมื่อวันที่ 24 มิถุนายน 2546 เห็นชอบให้กระทรวงเกษตรและสหกรณ์ จัดงานมหกรรมพืชสวนโลก 2549 ณ ศูนย์วิจัยเกษตรหลวงเชียงใหม่ ตำบลแม่เหียะ
อำเภอเมือง จังหวัดเชียงใหม่ (พื้นที่ 468 ไร่ 3 งาน 10 ตารางวา) โดยจัดขึ้นระหว่างวันที่ 1 พฤศจิกายน 2549 ถึงวันที่ 31 มกราคม 2550 รวม 92 วันภายใต้ชื่อ
“มหกรรมพืชสวนโลกเฉลิมพระเกียรติฯ ราชพฤกษ์ 2549” ซึ่งเป็นงานที่ประเทศไทยประสบความสำเร็จเป็นอย่างมาก จากความสำเร็จของการจัดงานมหกรรมพืชสวนโลกเฉลิมพระเกียรติฯ
ราชพฤกษ์ 2549 ที่ได้รับการตอบรับทั้งชาวไทยและชาวต่างประเทศเป็นอย่างดี คณะรัฐมนตรีจึงมีมติ เมื่อวันที่ 3 มิถุนายน 2551 ให้สถาบันวิจัยและพัฒนาพื้นที่สูง (องค์การมหาชน)
เข้ามาบริหารจัดการและใช้ประโยชน์พื้นที่สวนเฉลิมพระเกียรติฯ ราชพฤกษ์ 2549 เพื่อให้เกิดความคล่องตัวในการบริหารจัดการและปฏิบัติงานด้านต่างๆ
มีภารกิจหลักในการพัฒนาให้เป็นแหล่งเรียนรู้พืชสวนและเป็นแหล่งท่องเที่ยวทางการเกษตรและวัฒนธรรมของจังหวัดเชียงใหม่และประเทศไทย
โดยได้รับการถ่ายโอนกิจการ ทรัพย์สิน สิทธิ และงบประมาณของกระทรวงเกษตรและสหกรณ์มาเป็นของสถาบันวิจัยและพัฒนาพื้นที่สูง (องค์การมหาชน)
เมื่อวันที่ 15 กันยายน 2552 และมีการส่งมอบสวนเฉลิมพระเกียรติฯ ราชพฤกษ์ 2549 ในวันที่ 10 ธันวาคม 2552
สำหรับการตั้งชื่ออุทยานหลวงราชพฤกษ์นั้น หม่อมเจ้าภีศเดช รัชนี องค์ประธานมูลนิธิโครงการหลวง ได้มีลายพระหัตถ์ที่ ล. 01/358 ลงวันที่ 12 ตุลาคม 2552
ขอพระราชทานชื่อสวนซึ่งเป็นสถานที่จัดงานมหกรรมพืชสวนโลกเฉลิมพระเกียรติฯ ราชพฤกษ์ 2549 ณ ศูนย์วิจัยเกษตรหลวงเชียงใหม่ อำเภอเมืองเชียงใหม่ จังหวัดเชียงใหม่ ว่า
“สวนหลวงราชพฤกษ์” ต่อมาท่านผู้หญิงบุตรี วีระไวทยะ รองราชเลขาธิการ ปฏิบัติราชการแทนราชเลขาธิการ ได้นำความกราบบังคมทูลพระกรุณาโปรดเกล้าฯ
พระราชทานชื่อสวนดังกล่าวว่า “อุทยานหลวงราชพฤกษ์” ตั้งแต่วันที่ 23 มกราคม 2553 และได้รับพระราชทานชื่อภาษาอังกฤษว่า “Royal Park Rajapruek”
ตามหนังสือสำนักราชเลขาธิการที่ รล. 003.4/55045 ลงวันที่ 22 มีนาคม 2553 ชื่ออุทยานหลวงราชพฤกษ์ หมายถึง สวนของพระมหากษัตริย์ต้นราชพฤกษ์
หรือ ต้นคูน(ลมแล้ง ภาษาพื้นเมืองภาคเหนือ) นั้น ได้รับการยกให้เป็น ดอกไม้ประจำชาติไทย และด้วยชื่ออันเป็นมงคลยิ่ง(ราชพฤกษ์ : ต้นไม้ของพระราชา)
ประจวบเหมาะกับงานพืชสวนโลก เฉลิมพระเกียติของพระบาทสมเด็จพระเจ้าอยู่หัวที่ได้จัดในสถานที่นี้ ชื่อดอกราชพฤกษ์จึงถูกใช้เป็นชื่อของอุทธยานหลวงแห่งนี้นั่นเอง">
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>
            <div class="pin-map animated infinite" style="opacity: 1; top: 44%;left: 22%;
    animation-delay: 0.7s;">
                <a class="popup" data-img="<?php get_img('', ''); ?>" data-head="เชียงใหม่ไนท์ซาฟารี"
                   data-detail="เชียงใหม่ไนท์ซาฟารีเป็นสวนสัตว์ที่เกิดขึ้นตามแนวคิดของ ทักษิณ ชินวัตร[2] นายกรัฐมนตรี เขาได้ริเริ่มแนวคิดให้มีการศึกษาเพื่อจัดตั้ง สวนสัตว์กลางคืนเชียงใหม่ เนื่องจากเห็นว่าเป็นรูปแบบหนึ่งของการท่องเที่ยวเชิงคุณภาพ เป็นที่นิยมของนักท่องเที่ยว ดัง เช่นของประเทศสิงคโปร์ซึ่งประสบความสำเร็จและมีชื่อเสียงระดับโลก เมื่อมีแนวคิดดังกล่าวเกิดขึ้น นายกรัฐมนตรีจึงแจ้งผ่านนายโกสินทร์ เกษทอง ผู้ว่าราชการจังหวัดเชียงใหม่ในขณะนั้นเพื่อหาสถานที่เหมาะสมรองรับ ระยะแรกมีผู้เสนอพื้นที่ป่าไม้หลายจุด เช่นบริเวณป่าไม้ในเขตอำเภอดอยสะเก็ด แต่ที่สุดคณะทำงานหาพื้นที่ก็ที่ได้ข้อยุติที่บริเวณเชิงดอยสุเทพ ซึ่งจุดที่ดีที่สุดอยู่ในเขตตำบลแม่เหียะ อำเภอเมืองเชียงใหม่ ซึ่งอยู่ในเขตอุทยานแห่งชาติดอยสุเทพ-ปุย เนื่องจากมีสภาพภูมิประเทศที่ดีกว่าสิงคโปร์
สำนักนายกรัฐมนตรี ได้มีคำส่งที่ 90/2545 ลงวันที่ 25 มีนาคม พ.ศ. 2545 แต่งตั้งคณะกรรมการศึกษาการจัดตั้งสวนสัตว์กลางคืนจังหวัดเชียงใหม่และกิจกรรมที่เกี่ยวเนื่องเพื่อส่งเสริมการท่องเที่ยว (สสค.) และได้มีมติคณะรัฐมนตรีเมื่อวันท่ 28 ตุลาคม 2546 อนุมัติงบประมาณโครงการ เชียงใหม่ไนท์ซาฟารี วงเงิน 1,155.9 ล้านบาท ให้กระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม โดยกรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช เป็นหน่วยเบิกจ่ายงบประมาณ ดำเนินการก่อสร้างโดยกรมการทหารช่าง
            9 กันยายน 2547 สำนักนายกรัฐมนตรีได้มีคำสั่งที่ 224/2547 จัดตั้งสำนักงานบริหารโครงการเชียงใหม่ไนทซ์าฟารี โดยมี นายปลอดประสพ สุรัสวดี เป็นผู้อำนวยการ และให้เชียงใหม่ไนท์ซาฟารีเป็นหน่วยงานภายใต้องค์การบริหารการพัฒนาพื้นที่พิเศษเพื่อการท่องเที่ยวอย่างยั่งยืน (องค์การมหาชน)">
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>
            <div class="pin-map animated infinite" style="opacity: 1; top: 55%;left: 32%;
    animation-delay: 0.6s;">
                <a class="popup" data-img="<?php get_img('', ''); ?>"
                   data-head="สวนพฤกษศาสตร์วรรณคดีแม่เหียะ"
                   data-detail="สวนพฤกษศาสตร์วรรณคดีแม่เหียะ เดิมชื่อสวนพฤกษศาสตร์วรรณคดีภาคเหนือ ตั้งขึ้นในปี พ.ศ.2530 โดยสำนักงานปลัดกระทรวงเกษตรและสหกรณ์ เพื่อเฉลิม พระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัว เนื่องในวโรกาสทรงพระเจริญพระชนมพรรษาครบ 60 พรรษา โดยใช้พื้นที่ป่าสงวนแห่งชาติพิเศษ บริเวณป่าดอยสุเทพ ตำบลแม่เหียะ อำเภอเมือง จังหวัดเชียงใหม่ จำนวน 1,000 ไร่ ต่อมาในปี พ.ศ. 2535 ได้โอนให้กรมป่าไม้ ในปัจจุบันอยู่ในความรับผิดชอบของกรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช">
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>
            <div class="pin-map animated infinite" style="opacity: 1; top: 48%;left: 52%;
    animation-delay: 0.3s;">
                <a class="popup" data-img="<?php get_img('', ''); ?>"
                   data-head="ตลาดสดแม่เหียะ เชียงใหม่"
                   data-detail="ตลาดสดแม่เหี้ยะ ตลาดสดของตำบลชาวแม่เหี้ยะและใกล้เคียง  ใครไปใครมาก็ต้องแวะตลาดแม่เหี้ยะนี้เพราะมีของให้เลือกซื้อมากมาย อาทิ ของสด ผลไม้ ปลา เนื้อ ไก่ หมูกับข้าวสุกกับข้าวเมืองเหนือ ของป่า นอกจากนี้ยังมีร้านขายของอื่นๆ อีก เช่น ร้านขายยาร้านแบเกอรี่ศูนย์อาหารร้านขายของชำร้านขายเครื่องมือการเกษตรซ่อมนาฬิกาโลตัสเอ็กเพรส  อีกหนึ่งอย่างที่เป็นที่ถูกอกถูกใจคนมาซื้อของตลาดนี้ก็เป็น ไส้อั่ว ไส้อั่วที่ตลาดแม่เหี้ยะอร่อยมาก ใครไปแถวนั้นก็ลองไปแวะซื้อมาทานกันดู

ตลาดสดแม่เหี้ยะ  การเดินทาง ใช้ถนนเส้น เชียงใหม่ –หางดง ถึงสี่แยก Big C สาขา หางดง  ให้เลี้ยวขวา ถึงตรงมาจนถึง ถนนเส้นคลองชลประทาน (ขับตรงมาจนถึงสี่แยกไฟแดง มีที่เดียว ) ให้เลี้ยวซ้ายขับตรงมาอีก 50 เมตร ตลาดสดแม่เหี้ยะอยู่ด้านซ้ายมือ">
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>
            <div class="pin-map animated infinite" style="opacity: 1; top: 52%;left: 73%;
    animation-delay: 0.1s;">
                <a class="popup" data-img="<?php get_img('', ''); ?>" data-head="Big-c หางดง"
                   data-detail="บิ๊กซี เกิดจากความคิดกลุ่มค้าปลีกในเครือเซ็นทรัลและเครืออิมพีเรียลเมื่อ พ.ศ. 2536 โดยได้ทำการก่อตั้งบริษัท เซ็นทรัล ซูเปอร์สโตร์ จำกัดขึ้นมา และได้ทำการเปิดสาขาแรกบนถนนแจ้งวัฒนะ ในปี พ.ศ. 2537[1] และก็ได้ทำการเปลี่ยนชื่อเป็นบิ๊กซี ซูเปอร์เซ็นเตอร์ ในปี พ.ศ. 2538 แต่ต่อมาจนกระทั่งถึงช่วงวิกฤติเศรษฐกิจในปี พ.ศ. 2540 บริษัท Casino Guichard-Perrachon ผู้ประกอบการค้าปลีกอันดับสองของฝรั่งเศส ได้เข้ามาเพิ่มทุนและก็กลายเป็นผู้ถือหุ้นใหญ่ใน พ.ศ. 2542">
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>
            <div class="pin-map animated infinite" style="opacity: 1; top: 53%;left: 80%;
    animation-delay: 0.5s;">
                <a class="popup" data-img="<?php get_img('', ''); ?>" data-head="เทศบาลเมืองแม่เหียะ"
                   data-detail="ตำบลแม่เหียะเป็นตำบลเก่าแก่มีการตั้งรากฐานของชุมมชน บริเวณพื้นที่เชิงเข้าพระธาตุดอยคำ ประชาชนตั้งบ้านเรือนเรียงรายอยู่บริเวณสองฝั่งลำห้วยขนาดใหญ่และลำห้วยแห่งนี้มีต้นไม้ไผ่ชนิดหนึ่งขึ้นอยู่ริมสองฝั่ง น้ำ ชาวล้านนาโบราณเรียกว่า “ไม้เฮียะ” ดังนั้น ลำน้ำแห่งนี้จึงได้ถูกเรียกว่า“ลำห้วยแม่เฮียะ”และสันนิฐานว่าลำน้ำนี้ได้ถูกนำมาตั้งเป็นชื่อตำบลว่า ตำบลแม่เหียะซึ่งเป็นคำที่เพี้ยนมาจาก“แม่เฮียะ” จึงชื่อตำบลแม่เหียะมาถึงปัจจุบัน ศาสนสถาน ในพื้นที่ตำบลแม่เหียะ">
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>



            <div class="pin-map animated infinite" style="opacity: 1; top:66%;left: 69.50%;
    animation-delay: 0.4s;">
                <a class="popup" data-img="<?php get_img('doikam.png', 'map'); ?>"
                   data-head="บริษัท สยามแม็คโคร จำกัด (มหาชน)"
                   data-detail=""
                >
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>


            <div class="pin-map animated infinite" style="opacity: 1; top:30.50%; left: 40.2%;
    animation-delay: 0.4s;">
                <a class="popup" data-img="<?php get_img('doikam.png', 'map'); ?>"
                   data-head="บริษัท สยามแม็คโคร จำกัด (มหาชน)"
                   data-detail=""
                >
                    <img src="<?php get_img('icon-map.png', 'map'); ?>" alt="">
                </a>
            </div>




        </div>
    </div>
</div>
<style>
    .modal-backdrop.show {
        opacity: 0.8;
    }

    #detail-pg-modal {
        text-align: justify;
    }
</style>
<div class="modal fade" id="exampleModal" tabindex="-1" role="dialog" aria-labelledby="exampleModalLabel"
     aria-hidden="true" style="padding: 30px;">
    <div class="modal-dialog modal-lg" role="document">
        <div class="pic animated infinite">
            <img src="" alt="" id="img-tv">
        </div>
        <div class="modal-content">
            <div class="modal-header" style="padding: 0; height: 66px;">
                <img src="" id="head-img" style="width: 100%;top: -47px;position: relative;">
                <div class="close" style="padding: 0;position: absolute;top: -6px;left: 769px;opacity: 1;"
                     data-dismiss="modal">
                    <img src="<?php get_img('close.png', 'map'); ?>" alt=""
                         style="width: 50px;height: 50px">
                </div>
            </div>
            <div class="modal-body">
                <h1 id="head-tv-modal" style="margin: 30px 0 0 0;"></h1>
                <div id="detail-pg-modal"></div>
            </div>
            <div class="modal-footer">
                <!--                <button type="button" class="btn btn-primary">รายละเอียด</button>-->
                <button type="button" class="btn btn-secondary" data-dismiss="modal">ปิด</button>
            </div>
        </div>
    </div>
</div>
<script>
    $('#head-img').attr('src', $('#animation').attr('data-img'));
    $('#exampleModal').on('show.bs.modal', function () {
        $('#head-tv-modal').text('');
        $('#detail-pg-modal').text('');
    });
    $('.popup').click(function () {
        $('#exampleModal').modal('show');
        // $('#img-tv').attr('src', $(this).attr('data-img'));
        $('#head-tv-modal').text($(this).attr('data-head'));
        $('#detail-pg-modal').text($(this).attr('data-detail'));
    });
</script>
