<style type="text/css">

<!--
dd {color:#3241C2; font-size:13px;}
td {color:#5F255E
}
table {
	font-size=14px;
}
-->
</style>
<table width="90%">

<tr>
<td><div align="center" class="textblur"><b>อำนาจหน้าที่ตามกฎหมายจัดตั้งเทศบาลกำหนด</b></div><br>
<div class="text10">
<DD>สามารถแบ่งแยก ประเภทอำนาจหน้าที่ ของเทศบาลไว้เป็น 2 ส่วน คือ หน้าที่บังคับ หรือหน้าที่ที่ต้องปฏิบัติ และอำนาจหน้าที่ที่เลือกปฏิบัติ ทั้งยังได้กำหนดอำนาจหน้าที่ของเทศบาลในฐานะต่างๆ ดังนี้ <br>
	<DD><b>1.พระราชบัญญัติเทศบาล พ.ศ.2496 แก้ไขเพิ่มเติมจนถึงฉบับที่ 12 พ.ศ. 2546 <br>
<DD><br><DD><b>มาตรา ๕๐ ภายใต้บังคับแห่งกฎหมาย เทศบาลตำบล มีหน้าที่ต้องทำให้เขตเทศบาล ดังต่อไปนี้</b>
	<DD><DD>(๑) รักษาความสงบเรียบร้อยของประชาชน
	<DD><DD>(๒) ให้มีและบำรุงทางบกและทางน้ำ
	<DD><DD>(๓) รักษาความสะอาดของถนน หรือทางเดินและที่สาธารณะ รวมทั้งการกำจัดมูลฝอย
				<DD><DD>และสิ่งปฏิกูล
	<DD><DD>(๔) ป้องกันและระงับโรคติดต่อ
	<DD><DD>(๕) ให้มีเครื่องใช้ในการดับเพลิง
	<DD><DD>(๖) ให้ราษฎรได้รับการศึกษาอบรม
	<DD><DD>(๗) ส่งเสริมการพัฒนาสตรี เด็ก เยาวชน ผู้สูงอายุ และผู้พิการ
	<DD><DD>(๘) บำรุงศิลปะ จารีตประเพณี ภูมิปัญญาท้องถิ่น และวัฒนธรรมอันดีของท้องถิ่น
	<DD><DD>(๙) หน้าที่อื่นตามที่กฎหมายบัญญัติให้เป็นหน้าที่ของเทศบาล 
<DD><br><DD><b>มาตรา ๕๑  ภายใต้บังคับแห่งกฎหมาย เทศบาลตำบลอาจจัดทำกิจกรรมใด ๆ ในเขตเทศบาล ดังต่อไปนี้</b>
	<DD><DD>(๑) ให้มีน้ำสะอาดหรือการประปา
	<DD><DD>(๒) ให้มีโรงฆ่าสัตว์
	<DD><DD>(๓) ให้มีตลาด ท่าเทียบเรือและท่าข้าม
	<DD><DD>(๔) ให้มีสุสานและฌาปนสถาน
	<DD><DD>(๕) บำรุงและส่งเสริมการทำมาหากินของราษฎร
	<DD><DD>(๖) ให้มีและบำรุงสถานที่ทำการพิทักษ์รักษาคนเจ็บไข้
	<DD><DD>(๗) ให้มีและบำรุงการไฟฟ้าหรือแสงสว่างโดยวิธีอื่น
	<DD><DD>(๘) ให้มีและบำรุงทางระบายน้ำ
	<DD><DD>(๙) เทศพาณิชย์
<DD><br><DD><b>2. อำนาจหน้าที่ตามกฎหมายเฉพาะอื่นๆ กำหนด  </b>
	<DD>นอกจากอำนาจหน้าที่ตามพระราชบัญญัติเทศบาล พ.ศ.2496 กำหนดไว้แล้วยังมีกฎหมายเฉพาะอื่นๆ กำหนดให้เทศบาลมีอำนาจ หน้าที่ดำเนินกิจการให้เป็นไปตามกฎหมายนั้นๆอีกเป็นจำนวนมาก เช่น <br>
<DD><DD>1. พระราชบัญญัติป้องกันภยันตราย อันเกิดแก่การเล่นมหรสพ พ.ศ.2464 
<DD><DD>2. พระราชบัญญัติภาษีโรงเรือนและที่ดิน พ.ศ.2534 
<DD><DD>3. พระราชบัญญัติสาธารณสุข พ.ศ.2535 
<DD><DD>4. พระราชบัญญัติควบคุมการใช้อุจจาระทำปุ๋ยพ.ศ.2490 
<DD><DD>5. พระราชบัญญัติควบคุมการโฆษณา โดยใช้เครื่องขยายเสียง พ.ศ.2493 
<DD><DD>6. พระราชบัญญัติป้องกันและระงับอัคคีภัย พ.ศ.2495 
<DD><DD>7. พระราชบัญญัติป้องกันโรคพิษสุนัขบ้า พ.ศ.2535 
<DD><DD>8. พระราชบัญญัติการทะเบียนราษฎร พ.ศ.2534 
<DD><DD>9. พระราชบัญญัติควบคุมการฆ่าและจำหน่ายเนื้อสัตว์ พ.ศ.2535 
<DD><DD>10. พระราชบัญญัติรักษาความสะอาดและความเป็นระเบียบเรียบร้อยของบ้าน
			<DD><DD>เมือง พ.ศ.2535 
<DD><DD>11. พระราชบัญญัติจัดระเบียบการจอดยานยนต์ในเขตเทศบาลและสุขาภิบาล
			<DD><DD>พ.ศ.2503 
<DD><DD>12. พระราชบัญญัติภาษีบำรุงท้องที่ พ.ศ.2508 
<DD><DD>13. พระราชบัญญัติภาษีป้าย พ.ศ.2510 
<DD><DD>14. พระราชบัญญัติการผังเมือง พ.ศ.2518 
<DD><DD>15. พระราชบัญญัติควบคุมอาหาร พ.ศ.2522 
<DD><DD>16. พระราชบัญญัติโรคติดต่อ พ.ศ.2523 
<DD><DD>17. พระราชบัญญัติประถมศึกษา พ.ศ.2523 
<DD><DD>18. พระราชบัญญัติรักษาคลองประปา พ.ศ.2526 
<DD><DD>19. พระราชบัญญัติสุสานและณาปนสถาน พ.ศ.2528 
<DD><DD>20. ประกาศของคณะปฏิวัติ ฉบับที่ 44 ลงวันที่ 11 มกราคม 2502 
<DD><DD>21. ประกาศของคณะปฏิวัติ ฉบับที่ 68 ลงวันที่ 3 กุมภาพันธ์ 2515 ( กฎหมายว่าด้วย
			<DD><DD>การควบคุมการจอดเรือในแม่น้ำลำคลอง) 
<DD><DD>22. ประกาศของคณะปฏิวัติ ฉบับที่ 295 ลงวันที่ 28 พฤศจิกายน 2515 (กฎหมาย
			<DD><DD>ว่าด้วยทางหลวง) 
 <DD><DD>23. ประมวลกฎหมายที่ดิน(ซึ่งได้รับมอบหมายให้ดูแลรักษาที่สาธารณสมบัติ
			<DD><DD>ของแผ่นดินประเภทที่รกร้างว่างเปล่า ตามคำสั่ง กระทรวงมหาดไทยที่ 890/2498
</div>
</td>
</tr>
</table>
</center>


	 
	  <br>
	  <br>
	  </td>
  </tr>
</table>
